Autodesk.Revit.DB.ZoomFitType
This enum is used to define type of zoom.
Since:
2011

Autodesk.Revit.DB.ZoomFitType.Zoom
Calculate the size of the image using physical size of the view, zoom value and resolution.

Autodesk.Revit.DB.ZoomFitType.FitToPage
Fit the whole view into a specific image size.